-- 2014-12-17 by yangfuyou

--
-- Database: `cuteframe`
--

-- --------------------------------------------------------

--
-- 表的结构 `dict_item`
--

CREATE TABLE IF NOT EXISTS `dict_item` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT COMMENT '明细主键',
  `dict_id` int(11) NOT NULL COMMENT '字典id',
  `name` tinyint(4) NOT NULL COMMENT '枚举key',
  `label` varchar(10) NOT NULL COMMENT '枚举显示标识',
  `note` varchar(200) DEFAULT NULL COMMENT '描述',
  `display_order` int(11) NOT NULL COMMENT '顺序号',
  `is_system` tinyint(4) NOT NULL DEFAULT '0' COMMENT '系统内置',
  `is_deleted` tinyint(4) NOT NULL DEFAULT '0' COMMENT '删除标记',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 COMMENT='字典明细表' AUTO_INCREMENT=38 ;

--
-- 转存表中的数据 `dict_item`
--

INSERT INTO `dict_item` (`id`, `dict_id`, `name`, `label`, `note`, `display_order`, `is_system`, `is_deleted`) VALUES
(1, 1, 1, '超级管理员', '超级管理员', 1434567890, 1, 0),
(2, 1, 2, '权限管理员', NULL, 1435677779, 1, 0),
(3, 1, 3, '系统用户', NULL, 1435677778, 1, 0),
(4, 2, 1, '启用', '启用', 1417954105, 1, 0),
(5, 2, 0, '停用', '停用', 1417954167, 1, 0),
(6, 3, 1, '在职', '在职', 1417954865, 1, 0),
(7, 3, 0, '离职', '离职', 1417955381, 1, 0),
(8, 4, 0, '男', '男', 1418010228, 1, 0),
(9, 4, 1, '女', '女', 1418010445, 1, 0),
(10, 5, 0, '否', '', 1418104095, 1, 0),
(11, 5, 1, '是', '', 1418104105, 1, 0),
(12, 6, 1, '用户不存在', NULL, 1, 1, 0),
(13, 6, 2, '账户未启用', NULL, 2, 1, 0),
(14, 6, 3, '密码不正确', NULL, 3, 1, 0),
(15, 6, 4, '登陆成功', NULL, 4, 1, 0),
(16, 6, 5, '退出成功', NULL, 5, 1, 0),
(17, 6, 6, '修改密码', NULL, 6, 1, 0),
(18, 6, 7, '邮箱不正确', NULL, 7, 1, 0),
(19, 7, 1, '初级', '', 1418366339, 0, 0),
(20, 7, 2, '助理', '', 1418366356, 0, 0),
(21, 7, 3, '中级', '', 1418366369, 0, 0),
(22, 7, 4, '副高级', '', 1418371308, 0, 0),
(23, 7, 5, '高级', '', 1418371322, 0, 0),
(24, 8, 1, '董事长', '', 1418374417, 0, 0),
(25, 8, 2, '总经理', '', 1418374694, 0, 0),
(26, 8, 3, '副总经理', '', 1418375288, 0, 0),
(27, 8, 4, '总监', '', 1418375392, 0, 0),
(28, 8, 5, '经理', '', 1418375556, 0, 0),
(29, 8, 6, '专员', '', 1418375564, 0, 0),
(30, 8, 7, '主管', '', 1418375571, 0, 0),
(31, 8, 8, '收银', '', 1418375604, 0, 0),
(32, 8, 9, '出纳', '', 1418375611, 0, 0),
(33, 8, 10, '前台文员', '', 1418375649, 0, 0),
(34, 8, 11, '秘书', '', 1418375654, 0, 0),
(35, 8, 12, '顾问', '', 1418375669, 0, 0),
(36, 8, 13, '咨询师', '', 1418375719, 0, 0),
(37, 8, 14, '工程师', '', 1418375727, 0, 0);


